---
type: RebarShapeConstraintCircumference
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarShapeConstraintCircumference

`Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintCircumference | 2012 | `public RebarShapeConstraintCircumference ( ElementId paramId , RebarShapeArcReferenceType refType )` |
| Property | ArcReferenceType | 2012 | `public RebarShapeArcReferenceType ArcReferenceType { get ; }` |